Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L03.tmx
Source language: en_us
Languages: zh_cn

source: The Yew's Embrace
zh_cn: 紫杉的拥抱

source: We could still see the old king's blood in the cracks in the flagstones beneath the new king's feet when he announced to us all that this was a unification, not a conquest, and that we had nothing to fear from the soldiers that fenced us round.
zh_cn: 在新国王向我们所有人宣布这是统一，不是征服，包围我们的士兵也没什么可怕的时候，我们尚能看到他脚下的石板缝中前国王的血。

source: The new king said that my sister the queen would become his wife and that he'd make the old king's baby son his very own heir.
zh_cn: 新国王说我姐姐——王后——将成为他的妻子，而且他还将立前国王的幼子为他自己的继承人。

source: That's how much he loved and honored our people, he said.
zh_cn: 简而言之他是多么多么地热爱并尊敬我们的人民，他说。

source: A month later, on a stormy day when the rain blew in at the windows and puddled on the floor, and we were huddled round the hearth, spinning by the light of oil lamps, the king burst in, soaking wet.
zh_cn: 一个月后，在一个暴风雨的日子，雨水从窗户吹进来打湿了地板，我们蜷缩在壁炉周围借着油灯的光在纺纱，这时国王突然闯了进来，他浑身湿透。

source: Eyes a-glitter, he told my sister that he had caught Lele, the wet nurse, down by the stream at the edge of the grove of the gods-
zh_cn: 他眼光闪烁，告诉我姐姐他在神祇园边上的小溪旁撞见了那个乳母乐乐——

source: And she'd been drowning the baby prince.
zh_cn: 她在溺死幼小的王子。

source: "She said she wouldn't permit him to grow up under my authority," he said. "I tried to save him, but I was too late."
zh_cn: “她说她不会允许他在我的权威下成长，”他说，“我试图救他，但太晚了。”

source: He held up his dripping hands. River weed clung to his arms above the elbows.
zh_cn: 他举起滴着水的手，河草缠绕在他肘上面的胳膊上。

source: "She'll be punished, though," the king continued, and you could see his whole body trembling like a struck bell as he spoke.
zh_cn: “不过她将受到惩罚，”国王继续说道，可以看到在他说话的时候他的整个身体颤抖得像一口被敲打的钟。

source: It was anger, red anger, that caused him to shake.
zh_cn: 是愤怒，暴烈的愤怒使他颤抖。

source: None of us dared to move.
zh_cn: 我们没人敢动。

source: "I've ordered her flayed alive in the grove of the gods.
zh_cn: “我已下令在神祇园活剥了她。

source: It will stand as a lesson," he said, catching us each by eye, one by one, lingering on my sister.
zh_cn: 这将成为一个教训，”他说，眼神看向我们每一个人，一个接一个地，最后停留在我姐姐身上。

source: "No one may cross me.
zh_cn: “没人可以违抗我。

source: I will show no mercy to those who oppose me."
zh_cn: 对那些反对我的人我决不留情。”

source: I bit down hard on my lip, and I saw tears in the eyes of several of the other women.
zh_cn: 我狠狠地咬住嘴唇，我看到其他几个女人眼中的泪水。

source: We all loved Lele, and Lele had loved little Fremos more than gold or cream or kisses.
zh_cn: 我们都爱乐乐，乐乐爱小弗瑞缪斯（Fremos）胜过黄金、奶油、亲吻。

source: My sister was as still as a figure painted on a wall.
zh_cn: 我姐姐像画在墙上的一幅画像一样一动不动。

source: She didn't weep, or speak.
zh_cn: 她没有哭泣，也没有说话。

source: Even when the king put a hand on her shoulder, making a dark, wet spot bloom there as he spoke of other children to come, she didn't stir.
zh_cn: 甚至当国王把一只手放在她肩上，说着还会有其他孩子时，在她肩上印出一块深色的花形湿斑，她还是没动。

source: That night, we learned the soldiers charged with Lele's execution had deserted the king's service and fled.
zh_cn: 那天晚上，我们得知负责对乐乐行刑的士兵抛下对国王的职责逃跑了。

source: They were caught and killed, of course, but their deaths didn't stop their tale from spreading: how, under their knives, Lele had cried out to the gods, accusing the king and calling for justice, and how, as their merciless assault continued, she was transformed into a yew tree.
zh_cn: 当然他们被抓住杀了，但他们的死亡并没有阻止他们的故事的传播：在他们的刀下，乐乐如何向神祇大声呼喊，指控国王，呼吁正义，以及在他们无情的残害继续进行时，她如何被变成一棵紫杉树。

source: I'm sure the king wished he could chop down the tree and burn it, but who would dare to assault the gods' sanctuary, with the gods' power still resonant within?
zh_cn: 我确信国王希望他能砍倒那棵树，烧了它，但谁敢冒犯里面还回荡着神的力量的神的圣地？

source: In a year's time, my sister bore Neiros, and the king had a woman from his own country brought in to nurse the boy.
zh_cn: 一年后，我姐姐生下了内罗斯（Neiros），国王让人从他自己的国家带来一个女人来看护这个男孩。

source: We all wished to hate him, but he was a laughing, sunny baby.
zh_cn: 我们都希望恨他，但他是一个爱笑的、性格开朗的小孩。

source: My sister would bounce him on her knee and sing to him when the nurse brought him to her, so we let go of our hate, though I'm sure I'm not the only one who felt a pang when walking by the stream at the edge of the grove of the gods.
zh_cn: 保姆带他到我姐姐这儿来的时候，她会让他在她膝上蹦跳，给他唱歌，所以我们放下我们的仇恨，尽管我确定我不是唯一一个在走过神祇园边上的小溪时感到一阵悲伤的人。

source: Neiros was barely old enough to walk when the king took him in hand, determined to train him as a proper warrior heir from a young age.
zh_cn: 内罗斯才刚刚长到会走路国王就把他抓在手里，决心从小小年纪就训练他成为一个真正的武士继承人。

source: Year in and year out, we tried not to listen as he hectored, scolded, and swatted the poor child.
zh_cn: 一年又一年，在他威吓、责骂、重打这个可怜的孩子时我们努力不去听。

source: Neiros would slip away from his father when he could.
zh_cn: 如有可能，内罗斯会从他父亲身边溜走。

source: One day in his eighth year, when I was laying out the new linen cloth to bleach in the sun and Neiros was helping, we heard his father shouting for him.
zh_cn: 在他八岁那年，有一天，在我正摊开新亚麻布在太阳下漂白，内罗斯在帮忙时，我们听到他父亲在大声叫他。

source: "You'd better run along," I said. "Come back when you get a chance, and I'll give you some bread with honey."
zh_cn: “你最好离开，”我说，“有机会再回来，我会给你些蜂蜜面包。”

source: Neiros hugged me around the waist, burying his face in my chest.
zh_cn: 内罗斯抱住我的腰，把头埋在我的胸前。

source: "If Father hits me, I'll just run to Auntie in the trees," he said, voice muffled.
zh_cn: “如果父亲打我，我就跑去树上的阿姨那儿，”他说，声音低而含糊。

source: "Oh yes? And who is Auntie in the trees?" I asked.
zh_cn: “哦，是吗？谁是树上的阿姨？”我问。

source: "She's my protector. She's down in the grove of the gods," he said.
zh_cn: “她是我的保护者，她在神祇园里。”他说。

source: I felt the hairs on my arms rise up.
zh_cn: 我感到我胳膊上的汗毛都竖了起来。

source: "You go down there?
zh_cn: “你去了那里？

source: Someone speaks to you down there?"
zh_cn: 那儿有人跟你说话？”

source: "Auntie in the trees.
zh_cn: “是树上的阿姨。

source: The day I forgot to latch the gate and Father's new mare got out, I ran away to the trees down there and climbed up into one to hide.
zh_cn: 那天我忘了锁上门，父亲的新母马跑出去了，我逃向那里的树，爬上一棵藏起来。

source: The branches held me close, and I heard a voice say, 'I'll keep you safe.'
zh_cn: 树枝紧紧地抱着我，我听到一个声音说：‘我会让你安全的。’

source: I asked who it was, and she said she was my Auntie in the trees."
zh_cn: 我问它是谁，她说她是我树上的阿姨。”

source: "You must show me the tree," I managed to say, though my mouth had gone dry and my pounding heart stole away my breath.
zh_cn: “你一定要指给我看那棵树，”我最终努力说道，尽管我的嘴变干了，我怦怦跳的心让我无法呼吸。

source: But the king bellowed for Neiros again, and the boy ran off.
zh_cn: 但是国王又怒吼着叫内罗斯，这个孩子跑开了。

source: "Auntie in the trees has dark green needles and red berries," he called back over his shoulder. "Her branches are red and raw, like arms without skin."
zh_cn: “树上的阿姨有深绿色的针叶和红色的浆果，”他回头喊道，“她的枝干是红色粗糙的，就像没有皮肤的胳膊。”

source: After the cloth was spread, I walked down to the end of the garden, crossed the stream at the bridge, and entered the grove of the gods, a circle of silent oaks standing sentinel over clover, poppies, and bindweed.
zh_cn: 摊好布之后，我走向花园的尽头，从桥上跨过小溪，然后走进神祇园，一圈静默的橡树守卫着脚下的三叶草、罂粟和旋花。

source: I hadn't been to the grove since my sister married the old king, but I remembered it well enough to recognize the newcomer yew, more a thicket than a single tree, several narrow trunks outspread like hands shielding a face, with one great bough flung up and twisted, as if to ward off blows.
zh_cn: 自从我姐姐嫁给前国王后我就没来过这个园子，但我对它的记忆还是可以让我认出新来的紫杉，与其说这是一棵单独的树，不如说是一丛灌木，几根细长的树枝像手护着脸一样伸展开来，一根大树枝向上挥舞扭曲，好像是要挡开攻击。

source: I've seen spear hafts made of yew; they're a rich red color.
zh_cn: 我见过用紫杉做的枪柄，它们是鲜艳的红色。

source: Seeing that same ruddiness on the limbs of the living tree- so much like bare muscle and sinew- I thought of Lele and had to close my eyes.
zh_cn: 在活生生的树的枝干上看到同样的红色——这么像赤裸的肌肉和肌腱——我想起了乐乐，不得不闭上眼睛。

source: "You don't mean to harm the new prince, do you?" I asked, but the words felt like pebbles in my mouth.
zh_cn: “你不是要伤害新王子，是不是？”我问，但这些话语感觉就像石子一样塞在我的嘴里。

source: How can you question me?
zh_cn: 你怎么能质问我呢？

source: In my mind's eye, I saw Lele running after the new king, who carried a squirming bundle down to the stream.
zh_cn: 在想象中，我看到乐乐在追赶新国王，他带着一个蠕动的包裹走向小溪。

source: I saw her wrestle with him, saw the soldiers pull her away.
zh_cn: 我看到她与他扭打，看到士兵把她拉开。

source: I could almost feel the grip of their hands upon her and the cold rain streaming down her face and hair.
zh_cn: 我几乎可以感觉到他们的手紧紧地抓住她，冰冷的雨水流下她的脸和头发。

source: Here, now, a cold wind pulled at my own hair and my skirts.
zh_cn: 就在此时此地，一阵冷风猛吹我自己的头发和裙子。

source: I opened my eyes and saw thunderclouds.
zh_cn: 我睁开眼睛，看到乌云密布。

source: The oaks were murmuring now. The yew was whispering too, but not in human speech.
zh_cn: 此刻橡树在喃喃低语，紫杉也在低声说话，但不是用人类的语言。

source: Not in human speech, but I could feel the meaning all the same.
zh_cn: 不是用人类的语言，但我还是能感觉到那种意思。

source: It wasn't until some days later that I was able to give Neiros the bread and honey I had promised him.
zh_cn: 直到几天以后我才能够给内罗斯我许诺的面包和蜂蜜。

source: "I have a brother," Neiros announced, breaking off fragments of his bread and feeding them to the king's dogs, who have a knack for finding people who are eating.
zh_cn: “我有一个哥哥，”内罗斯宣布说，他掰碎面包喂给国王的狗，它们有一种找到吃东西的人的诀窍。

source: "He's a year older than I am.
zh_cn: “他比我大一岁。

source: He lives in the stream at the bottom of the garden."
zh_cn: 他住在花园尽头的小溪里。”

source: The cook's knife stopped halfway through an onion, and she glanced at me, eyebrows raised.
zh_cn: 厨师在切洋葱的刀正切在一半停下了，她匆匆地瞥了我一眼，眉毛上扬。

source: Her little maid, who was scaling the fish, looked at her mistress anxiously.
zh_cn: 她的小女仆，正在清除鱼鳞，不安地看着她的女主人。

source: "A brother in the stream?" I asked, keeping my tone light.
zh_cn: “一个在小溪里的哥哥？”我问，语气保持轻松。

source: "Yes.
zh_cn: “是的。

source: He can only eat fish and snails.
zh_cn: 他只能吃鱼和蜗牛。

source: He never gets bread.
zh_cn: 他根本吃不到面包。

source: And he has to eat the fish raw, because there isn't any fire under the water."
zh_cn: 他还不得不生吃鱼，因为在水下没有火。”

source: Neiros bit down on his bread and chewed it slowly.
zh_cn: 内罗斯咬下一口面包，慢慢咀嚼。

source: One of the dogs licked Neiros's free hand.
zh_cn: 其中一条狗在舔内罗斯空着的手。

source: "How did you find this brother?" I asked.
zh_cn: “你是怎么找到这个哥哥的？”我问。

source: "Did he call to you?" breathed the maid, but the cook shushed her.
zh_cn: “他叫你了吗？”女仆小声问，但厨师用‘嘘’声制止了她。

source: "Auntie in the trees told me about him.
zh_cn: “树上的阿姨告诉了我关于他的事。

source: She told me his name is Fremos.
zh_cn: 她告诉我他名叫弗瑞缪斯。

source: She said if I stepped into the stream and called him, he'd come.
zh_cn: 她说如果我走进小溪里叫他，他就会来的。

source: And he did!
zh_cn: 他真的来了！

source: And we talked." Neiros frowned. "Fremos is lonely, though.
zh_cn: 我们一起谈话。”内罗斯皱起眉头，“不过，弗瑞缪斯很孤单。

source: He's all alone in the river.
zh_cn: 他一个人在河里。

source: He asked me if I would come under the water with him, but . . ."
zh_cn: 他问我是否愿意和他一起到水下面去，但是......

source: Neiros's frown deepened. "I was scared to.
zh_cn: ”内罗斯的眉头皱得更深了，“我害怕。

source: So I asked him if he could come out instead, and he said, maybe if I grabbed his hands and pulled.
zh_cn: 所以我问他他能不能出来，他说，如果我抓住他的手用力拉或许能。

source: So I did grab and pull, but I couldn't budge him.
zh_cn: 所以我抓住拉了，但我拉不动他。

source: He stayed underneath.
zh_cn: 他待在下面。

source: Father would say I'm a weakling, wouldn't he.
zh_cn: 父亲会说我是一个懦夫，会不会？

source: Do you think Father would say I'm a weakling?"
zh_cn: 你认为父亲会说我是一个懦夫吗？”

source: "No, he wouldn't say that," I said. "But I think he would say- He would say you shouldn't play in that stream. Or by it. Or- "
zh_cn: “不，他不会那么说的，”我说，“但我想他会说——他会说你不该在那条小溪里玩，或者在它旁边，或者——”

source: "I have to," insisted Neiros. "Otherwise Fremos will die of loneliness, and I'll lose my only brother.
zh_cn: “我必须去，”内罗斯坚决地说，“否则弗瑞缪斯会孤单死的，我就会失去我唯一的哥哥。

source: Auntie in the trees says I have a father and a mother and a palace full of people to love and serve me, but Fremos has no one."
zh_cn: 树上的阿姨说我有一个父亲、一个母亲和一皇宫的人爱我、服侍我，但弗瑞缪斯一个人都没有。”

source: Neiros squeezed his remaining fragment of bread between his fingers and thumb, squeezed it and rolled it.
zh_cn: 内罗斯用手指捏着他剩下的面包片，挤压揉搓。

source: Then he threw it onto the floor and looked up at me. "Why does my brother live in a stream?" he asked.
zh_cn: 然后他把面包扔到地板上，抬头看向我，“为什么我哥哥住在小溪里？”他问。

source: At just that moment, the king walked in.
zh_cn: 就在这时，国王走了进来。

source: The cook's maid hid behind the cook.
zh_cn: 厨师的女仆躲到厨师身后。

source: "What did you say?" the king asked, in a low, dangerous voice.
zh_cn: “你说什么？”国王问道，声音低沉而危险。

source: "I want to know why my brother lives in a stream," Neiros repeated, balling his hands into fists as he stared at his father.
zh_cn: “我想知道为什么我哥哥住在小溪里，”内罗斯重复说道，他盯着他父亲时手攥成了拳头。

source: The two of them wore matching frowns.
zh_cn: 他们两个皱着同样的眉头。

source: "Auntie in the trees said you made him live there."
zh_cn: “树上的阿姨说是你让他住在那里的。”

source: "Who said it? She said it?" He pointed at me and crossed the room in quick strides.
zh_cn: “谁说的？她说的？ ”他指着我，快步跨过房间。

source: He had his knife in his hand; I think he meant to kill me then and there.
zh_cn: 他手上拿着刀，我想他是要当场杀了我。

source: "No! Not her! Auntie in the trees! Auntie in the trees said it."
zh_cn: “不！不是她！是树上的阿姨！树上的阿姨说的！”

source: Neiros's voice was thin, high, and desperate.
zh_cn: 内罗斯的声音尖细而急切。

source: He rammed into his father, knocking the knife from his hand and startling the dogs, who jumped up, barking.
zh_cn: 他撞向他父亲，从他手上打掉刀，惊到了狗，它们跳起来大叫。

source: Then he ducked around him and dashed out of the kitchen.
zh_cn: 然后他迅速绕过他，冲出厨房。

source: "The yew tree.
zh_cn: “那棵紫杉。

source: He's running to the yew tree, and she'll have her revenge on you."
zh_cn: 他跑向那棵紫杉了，她要报复你的。”

source: It must have been the gods speaking through me. I would never have dared say those words to the king's face otherwise.
zh_cn: 一定是神在通过我说话，否则我是永远不敢当着国王的面说这些话的。

source: I felt my heart twist as they came out, not for the king, but for Neiros.
zh_cn: 说出这些话时我感觉我的心都扭成了一团，不是因为国王，而是为了内罗斯。

source: The king went as pale as ashes and ran out after Neiros, calling for his men to follow.
zh_cn: 国王面如死灰，跑出去追内罗斯，叫他的人跟上。

source: I ran after, too, stopping only to tell one of my sister's women what was happening.
zh_cn: 我也追上去，只停了一下告诉我姐姐的一个女仆发生了什么事。

source: "Tell her to come," I said.
zh_cn: “叫她来，”我说。

source: Who living had been more wronged than my sister?
zh_cn: 谁的生活比我姐姐的还要错乱？

source: Maybe she could stop this fate from unfolding.
zh_cn: 或许她能够阻止命运的演变。

source: Neiros had slipped right into the heart of the yew and had climbed up as high as he could go.
zh_cn: 内罗斯直接溜进了紫杉的中心，并且爬上了他能到达的最高处。

source: The yew clasped him tight in her bare, flayed arms.
zh_cn: 紫杉用她赤裸的、剥掉皮的手臂紧紧地抱着他。

source: The king and his men were arrayed in a semicircle around the tree.
zh_cn: 国王和他的人排列成一个半圆形围着这棵树。

source: "Come down! Come down here right now!" the king ordered, and, under his breath, "Let him go, or I will burn you down, and gods be damned."
zh_cn: “下来！马上下来！”国王命令道，然后压低嗓音，“放开他，否则我就烧了你，管他妈的什么神。”

source: "I won't!" said Neiros, still in that high, desperate voice.
zh_cn: “我不！”内罗斯说，声音仍然尖细而急切。

source: "Go pull my brother out of the stream!
zh_cn: “去把我哥哥从小溪里拉出来！

source: You put him there. Bring him back here where he belongs. Then I'll come down."
zh_cn: 你把他放在那里的，带他回到这个属于他的地方，我就下来。”

source: My sister and several of the other women arrived while Neiros was speaking.
zh_cn: 内罗斯说话的时候，我姐姐和其他几个女人到了。

source: Two bright patches shone on my sister's cheeks, but the rest of her face was as pale as the king's.
zh_cn: 我姐姐的脸颊上露出两团红晕，但她脸上的其他地方和国王一样苍白。

source: Her chest heaved from running, but her mouth was tight shut and her lips were bloodless.
zh_cn: 她的胸部由于奔跑而上下起伏，但她的嘴紧紧地闭着，她的嘴唇没有一点儿血色。

source: "Pull him out, or I'll never come down. I'll die here," said Neiros, his last words lost in a sob.
zh_cn: “拉他出来，否则我永远不下来，我就死在这里。”内罗斯说，他最后的话是呜咽着说的。

source: The king stared wild-eyed at the tree and his son, cursed the yew first quietly and then loudly, then strode back to the stream and splashed in.
zh_cn: 国王两眼圆睁，怒视着那棵树和他儿子，开始是默默地，继而是大声地诅咒紫杉，然后他大步走回小溪，扑通一声跳进去。
